In [1]:
# Load the SQL extension first (only shows once)
%load_ext sql

# Import required libraries
import os
from dotenv import load_dotenv
import urllib

# Load variables from your .env file (with UTF-8 encoding)
load_dotenv(encoding='utf-8-sig')

# Fetch variables
server = os.getenv("SERVER")
database = os.getenv("DATABASE")
driver = os.getenv("DRIVER")

# Build the connection string
params = urllib.parse.quote_plus(
    f"DRIVER={{{driver}}};SERVER={server};DATABASE={database};Trusted_Connection=yes;"
)
connection_string = f"mssql+pyodbc:///?odbc_connect={params}"

%sql {connection_string}
%config SqlMagic.displaycon = False  # Hide connection info
print("Secure connection established successfully!")

Secure connection established successfully!

CTE Course: Lesson 1 — Basic CTE Usage

Selecting Basic Employee Information

If you just want to select the first name, last name, and ID from the Person.Person table, you can do it with a simple SELECT statement:

In [3]:
%%sql

SELECT TOP 10 -- remove TOP 10 to see all results
    PEP.[FirstName],
    PEP.[LastName],
    PEP.BusinessEntityID
FROM Person.Person PEP;

Done.

[('Syed', 'Abbas', 285),
 ('Catherine', 'Abel', 293),
 ('Kim', 'Abercrombie', 295),
 ('Kim', 'Abercrombie', 2170),
 ('Kim', 'Abercrombie', 38),
 ('Hazem', 'Abolrous', 211),
 ('Sam', 'Abolrous', 2357),
 ('Humberto', 'Acevedo', 297),
 ('Gustavo', 'Achong', 291),
 ('Pilar', 'Ackerman', 299)]

This query will return all people in the Person.Person table with their first name, last name, and BusinessEntityID.

Using a CTE (Common Table Expression)

A CTE allows you to define a temporary result set that you can reference in a SELECT, INSERT, UPDATE, or DELETE statement. It’s especially useful when you want to simplify complex queries or break them into readable steps.

For example, if you want to combine person information with job titles from HumanResources.Employee, you can do:

In [24]:
%%sql

WITH EmployeeDetails AS (
    SELECT 
        HRE.[BusinessEntityID],
        HRE.[JobTitle]
    FROM HumanResources.Employee HRE
)
SELECT TOP 10
    PEP.[FirstName] /*remove TOP 10 to see all results*/,
    PEP.[LastName],
    ED.BusinessEntityID,
    ED.JobTitle
FROM Person.Person PEP
JOIN EmployeeDetails AS ED 
    ON PEP.BusinessEntityID = ED.BusinessEntityID
ORDER BY ED.BusinessEntityID;

Done.

[('Ken', 'Sánchez', 1, 'Chief Executive Officer'),
 ('Terri', 'Duffy', 2, 'Vice President of Engineering'),
 ('Roberto', 'Tamburello', 3, 'Engineering Manager'),
 ('Rob', 'Walters', 4, 'Senior Tool Designer'),
 ('Gail', 'Erickson', 5, 'Design Engineer'),
 ('Jossef', 'Goldberg', 6, 'Design Engineer'),
 ('Dylan', 'Miller', 7, 'Research and Development Manager'),
 ('Diane', 'Margheim', 8, 'Research and Development Engineer'),
 ('Gigi', 'Matthew', 9, 'Research and Development Engineer'),
 ('Michael', 'Raheem', 10, 'Research and Development Manager')]

TOPIC: CTE — Filtering by Value

Question:
List all products that have a ListPrice greater than 100.

Tables: Production.Product
Concept: Filtering rows

Simple (Non-CTE) Approach

The easiest way to do it is with a standard SELECT and WHERE clause

In [26]:
%%sql

SELECT TOP 10  /*remove TOP 10 to see all results*/
	[ProductID], [ListPrice]
FROM Production.Product
WHERE [ListPrice] > 100

Done.

[(514, Decimal('133.3400')),
 (515, Decimal('147.1400')),
 (516, Decimal('196.9200')),
 (517, Decimal('133.3400')),
 (518, Decimal('147.1400')),
 (519, Decimal('196.9200')),
 (520, Decimal('133.3400')),
 (521, Decimal('147.1400')),
 (522, Decimal('196.9200')),
 (680, Decimal('1431.5000'))]

Using a CTE

If you want to use a CTE to structure your query more clearly or prepare data for additional steps, you can write:

In [27]:
%%sql

WITH ListPriceabove100 AS(
SELECT
	[ProductID] Products,
	[Name] ProductName,
	[MakeFlag] Flag,
	[ListPrice] Price
FROM Production.Product
WHERE [ListPrice] > 100)
SELECT	TOP 10 /*remove TOP 10 to see all results*/
	Products,
	Price
FROM ListPriceabove100

Done.

[(514, Decimal('133.3400')),
 (515, Decimal('147.1400')),
 (516, Decimal('196.9200')),
 (517, Decimal('133.3400')),
 (518, Decimal('147.1400')),
 (519, Decimal('196.9200')),
 (520, Decimal('133.3400')),
 (521, Decimal('147.1400')),
 (522, Decimal('196.9200')),
 (680, Decimal('1431.5000'))]

TOPIC: CTE — Comparing to an Aggregate

Sometimes you need to compare each row in a table to an aggregate value such as an average. In this example, we want to find all sales orders where the OrderQty is greater than the average OrderQty of all orders.

This is a perfect example to show the link between subqueries and CTEs:
If you understand subqueries, then you already understand the logic behind CTEs — you’re just moving that logic to the top of the query.

Approach 1: Using a Subquery

A classic subquery returns the average OrderQty, and we compare each row to it:

In [29]:
%%sql

SELECT TOP 10 /*remove TOP 10 to see all results*/
    SOD.[SalesOrderID],
    SOD.[OrderQty]
FROM Sales.SalesOrderDetail SOD
WHERE SOD.[OrderQty] > 
    (
        SELECT
            AVG(SOD2.[OrderQty])
        FROM Sales.SalesOrderDetail SOD2
    );

Done.

[(43659, 3),
 (43659, 3),
 (43659, 6),
 (43659, 4),
 (43661, 4),
 (43661, 4),
 (43661, 3),
 (43661, 4),
 (43661, 5),
 (43662, 3)]

What this does:

The inner query calculates the average quantity of all orders.

The outer query returns only the orders where OrderQty is higher than that average.

Approach 2: Using a CTE

A CTE can be used to compute the same aggregate before the main query runs.

In [31]:
%%sql

WITH AverageOrderQuantity AS (
    SELECT 
        AVG(SOD.[OrderQty]) AS AverageOrder
    FROM Sales.SalesOrderDetail SOD
)
SELECT TOP 10 /*remove TOP 10 to see all results*/
    SOD2.[SalesOrderID],
    SOD2.[OrderQty]
FROM Sales.SalesOrderDetail SOD2
CROSS JOIN AverageOrderQuantity AOQ
WHERE SOD2.[OrderQty] > AOQ.AverageOrder;

Done.

[(43659, 3),
 (43659, 3),
 (43659, 6),
 (43659, 4),
 (43661, 4),
 (43661, 4),
 (43661, 3),
 (43661, 4),
 (43661, 5),
 (43662, 3)]

Explanation:

The CTE AverageOrderQuantity calculates the average order quantity once.

The CROSS JOIN attaches that single value to every row.

The WHERE clause filters orders above the average.

TOPIC: CTE — Filtering by Existence

In this lesson, we want to display all customers who belong to a territory (i.e., TerritoryID is not null). We also want to show their first name, last name, and territory.

This demonstrates simple filtering, and again shows how a query can be written using:

A normal SELECT

A subquery

A CTE

Approach 1: Simple Filtering (No Subquery, No CTE)

In [42]:
%%sql 

SELECT TOP 10 /*remove TOP 10 to see all results*/
    PEP.[FirstName],
    PEP.[LastName],
    SC.[TerritoryID]
FROM Person.Person AS PEP
JOIN Sales.Customer SC
    ON PEP.BusinessEntityID = SC.PersonID
WHERE SC.[TerritoryID] IS NOT NULL
ORDER BY TerritoryID;

Done.

[('Lauren', 'Walker', 1),
 ('Ian', 'Jenkins', 1),
 ('Sydney', 'Bennett', 1),
 ('Destiny', 'Wilson', 1),
 ('Ethan', 'Zhang', 1),
 ('Jesse', 'Murphy', 1),
 ('Noah', 'Powell', 1),
 ('Angela', 'Murphy', 1),
 ('Grace', 'Butler', 1),
 ('Caleb', 'Carter', 1)]

What this does:

Joins people with the customer table

Filters customers to only those who belong to a territory

Returns name + territory

Approach 2: Using a CTE

Now we move the filtering step into a CTE:

In [43]:
%%sql

WITH TerritoryNotNull AS (
    SELECT
        [PersonID],
        [TerritoryID] AS Territories
    FROM Sales.Customer 
    WHERE TerritoryID IS NOT NULL
)
SELECT TOP 10 /*remove TOP 10 to see all results*/
    PEP.[FirstName],
    PEP.[LastName],
    TNN.Territories
FROM Person.Person PEP
JOIN TerritoryNotNull AS TNN
    ON PEP.BusinessEntityID = TNN.PersonID
ORDER BY TNN.Territories;

Done.

[('Lauren', 'Walker', 1),
 ('Ian', 'Jenkins', 1),
 ('Sydney', 'Bennett', 1),
 ('Destiny', 'Wilson', 1),
 ('Ethan', 'Zhang', 1),
 ('Jesse', 'Murphy', 1),
 ('Noah', 'Powell', 1),
 ('Angela', 'Murphy', 1),
 ('Grace', 'Butler', 1),
 ('Caleb', 'Carter', 1)]

TOPIC: CTE — Latest Department per Employee

We want to find the most recent department each employee has worked in, along with their job title.
This requires identifying the latest StartDate per employee, which is a perfect case for ROW_NUMBER() in a CTE.

Tables:

HumanResources.Employee

HumanResources.EmployeeDepartmentHistory

HumanResources.Department

Concept: CTE with ROW_NUMBER() for latest entry

Approach 1: Subquery Version

In [46]:
%%sql

SELECT TOP 10  /*remove TOP 10 to see all results*/
    e.BusinessEntityID,
    e.JobTitle,
    d.Name AS DepartmentName,
    edh.StartDate AS DepartmentStartDate
FROM HumanResources.EmployeeDepartmentHistory edh
JOIN HumanResources.Employee e
    ON e.BusinessEntityID = edh.BusinessEntityID
JOIN HumanResources.Department d
    ON d.DepartmentID = edh.DepartmentID
WHERE edh.StartDate = (
    SELECT MAX(edh2.StartDate)
    FROM HumanResources.EmployeeDepartmentHistory edh2
    WHERE edh2.BusinessEntityID = edh.BusinessEntityID
)
ORDER BY edh.StartDate DESC;

Done.

[(234, 'Chief Financial Officer', 'Executive', datetime.date(2013, 11, 14)),
 (286, 'Sales Representative', 'Sales', datetime.date(2013, 5, 30)),
 (288, 'Sales Representative', 'Sales', datetime.date(2013, 5, 30)),
 (285, 'Pacific Sales Manager', 'Sales', datetime.date(2013, 3, 14)),
 (284, 'Sales Representative', 'Sales', datetime.date(2012, 9, 30)),
 (250, 'Purchasing Manager', 'Purchasing', datetime.date(2012, 7, 15)),
 (290, 'Sales Representative', 'Sales', datetime.date(2012, 5, 30)),
 (289, 'Sales Representative', 'Sales', datetime.date(2012, 5, 30)),
 (287, 'European Sales Manager', 'Sales', datetime.date(2012, 4, 16)),
 (224, 'Scheduling Assistant', 'Production Control', datetime.date(2011, 9, 1))]

What this does:

Finds the maximum (latest) StartDate for each employee.

Returns name, job title, department, and when they started in it.

Limited to TOP 10 rows for notebook readability.

Approach 2: CTE Version (Cleaner + More Scalable)

In [47]:
%%sql

WITH LatestDepartment AS (
    SELECT
        edh.BusinessEntityID,
        edh.DepartmentID,
        edh.StartDate,
        ROW_NUMBER() OVER (
            PARTITION BY edh.BusinessEntityID
            ORDER BY edh.StartDate DESC
        ) AS rn
    FROM HumanResources.EmployeeDepartmentHistory edh
)
SELECT TOP 10  /*remove TOP 10 to see all results*/
    e.BusinessEntityID,
    e.JobTitle,
    d.Name AS DepartmentName,
    ld.StartDate AS DepartmentStartDate
FROM LatestDepartment ld
JOIN HumanResources.Employee e
    ON e.BusinessEntityID = ld.BusinessEntityID
JOIN HumanResources.Department d
    ON d.DepartmentID = ld.DepartmentID
WHERE ld.rn = 1
ORDER BY ld.StartDate DESC;

Done.

[(234, 'Chief Financial Officer', 'Executive', datetime.date(2013, 11, 14)),
 (286, 'Sales Representative', 'Sales', datetime.date(2013, 5, 30)),
 (288, 'Sales Representative', 'Sales', datetime.date(2013, 5, 30)),
 (285, 'Pacific Sales Manager', 'Sales', datetime.date(2013, 3, 14)),
 (284, 'Sales Representative', 'Sales', datetime.date(2012, 9, 30)),
 (250, 'Purchasing Manager', 'Purchasing', datetime.date(2012, 7, 15)),
 (289, 'Sales Representative', 'Sales', datetime.date(2012, 5, 30)),
 (290, 'Sales Representative', 'Sales', datetime.date(2012, 5, 30)),
 (287, 'European Sales Manager', 'Sales', datetime.date(2012, 4, 16)),
 (224, 'Scheduling Assistant', 'Production Control', datetime.date(2011, 9, 1))]

Why this is better:

ROW_NUMBER() ranks departmental history per employee.

rn = 1 returns only the most recent row.

Much more efficient if employees have many history records.

TOPIC: CTE — Employee Pay History Trends

In this lesson, we want to find how employee pay rates have changed over time, and calculate the percentage increase or decrease between the most recent and previous pay rate.

Tables:

HumanResources.Employee

HumanResources.EmployeePayHistory

Concept: CTE with ROW_NUMBER() + self join to compare latest vs previous rate

In [48]:
%%sql

WITH RankedPaidHistory AS (
    SELECT
        [BusinessEntityID],
        [RateChangeDate],
        [Rate],
        ROW_NUMBER() OVER (
            PARTITION BY [BusinessEntityID]
            ORDER BY [RateChangeDate] DESC
        ) AS rn
    FROM HumanResources.EmployeePayHistory
)
SELECT TOP 10  /*remove TOP 10 to see all results*/
    HRE.[BusinessEntityID],
    HRE.[JobTitle],
    RLatest.Rate AS LatestRate,
    RPrevious.Rate AS PreviousRate,
    RLatest.RateChangeDate AS LatestChangeDate,
    RPrevious.RateChangeDate AS PreviousChangeDate,
    CASE 
        WHEN RPrevious.Rate IS NULL THEN NULL
        ELSE CAST(
            ((RLatest.Rate - RPrevious.Rate) * 100.0) / RPrevious.Rate
            AS DECIMAL(10, 2)
        )
    END AS PercentChange
FROM HumanResources.Employee HRE
JOIN RankedPaidHistory AS RLatest
    ON HRE.BusinessEntityID = RLatest.BusinessEntityID
    AND RLatest.rn = 1
LEFT JOIN RankedPaidHistory AS RPrevious 
    ON HRE.BusinessEntityID = RPrevious.BusinessEntityID
    AND RPrevious.rn = 2
ORDER BY PercentChange DESC;

Done.

[(178, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.0000'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('35.71')),
 (250, 'Purchasing Manager', Decimal('30.0000'), Decimal('22.5000'), datetime.datetime(2012, 7, 14, 0, 0), datetime.datetime(2011, 7, 30, 0, 0), Decimal('33.33')),
 (167, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (170, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (172, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (174, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (175, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (176, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (177, 'Production Technician - WC30', Decimal('9.5000'), Decimal('7.2500'), datetime.datetime(2013, 7, 14, 0, 0), datetime.datetime(2011, 12, 1, 0, 0), Decimal('31.03')),
 (16, 'Marketing Manager', Decimal('37.5000'), Decimal('28.7500'), datetime.datetime(2012, 4, 30, 0, 0), datetime.datetime(2009, 7, 15, 0, 0), Decimal('30.43'))]

Explanation

RankedPaidHistory ranks pay history per employee (most recent = rn = 1).

We join:

RLatest → latest pay record

RPrevious → previous pay record

A LEFT JOIN is used for previous rate in case an employee has only one pay record.

Percentage change is computed only when a previous rate exists.

TOPIC: CTE — Top Subcategories Discount

In this lesson, we want to identify the product subcategories with the highest average list price, and calculate a suggested 10% discount for these subcategories for high-end marketing campaigns.

Tables:

Production.Product

Concept:

CTE for aggregation and ranking

In [49]:
%%sql

WITH AvgSubcategories AS (
    SELECT
        [ProductSubcategoryID],
        AVG([ListPrice]) AS AvgListPrice
    FROM Production.Product
    GROUP BY [ProductSubcategoryID]
)

SELECT TOP 10 /*remove TOP 10 to see all results*/
    ProductSubcategoryID,
    AvgListPrice,
    AvgListPrice * 0.1 AS DiscountedAmount,
    AvgListPrice * 0.9 AS PriceAfterDiscount
FROM AvgSubcategories
ORDER BY AvgListPrice DESC;

Done.

[(1, Decimal('1683.3650'), Decimal('168.33650'), Decimal('1515.02850')),
 (2, Decimal('1597.4500'), Decimal('159.74500'), Decimal('1437.70500')),
 (3, Decimal('1425.2481'), Decimal('142.52481'), Decimal('1282.72329')),
 (14, Decimal('780.0436'), Decimal('78.00436'), Decimal('702.03924')),
 (12, Decimal('678.2535'), Decimal('67.82535'), Decimal('610.42815')),
 (16, Decimal('631.4155'), Decimal('63.14155'), Decimal('568.27395')),
 (8, Decimal('278.9900'), Decimal('27.89900'), Decimal('251.09100')),
 (17, Decimal('220.9292'), Decimal('22.09292'), Decimal('198.83628')),
 (10, Decimal('184.4000'), Decimal('18.44000'), Decimal('165.96000')),
 (27, Decimal('159.0000'), Decimal('15.90000'), Decimal('143.10000'))]

Notes

CTE (AvgSubcategories): Aggregates the average list price per subcategory.

TOP 10: Ensures the output is small in Jupyter notebooks; remove the comment to see all results.

Discount Calculations:

DiscountedAmount = AvgListPrice * 0.1

PriceAfterDiscount = AvgListPrice * 0.9

ORDER BY: Highest average price first